# SQL 操作数据库

In [1]:
import pymysql
from pandasql import sqldf, load_births, load_meat

## 加载内置数据集

In [2]:
df1 = load_births()
df2 = load_meat()

In [11]:
df1.head()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408 entries, 0 to 407
Data columns (total 2 columns):
date      408 non-null datetime64[ns]
births    408 non-null int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 6.5 KB

## 调用sqldf方法，参数为sql语句

In [5]:
sql = """
        select
            date,count(*) as n
        from df1
        group by date
        order by n desc;
      """
result = sqldf(sql)
result

                           date  n
0    1991-01-01 00:00:00.000000  3
1    1991-02-01 00:00:00.000000  3
2    1991-03-01 00:00:00.000000  3
3    1991-04-01 00:00:00.000000  3
4    1991-05-01 00:00:00.000000  3
..                          ... ..
295  2012-08-01 00:00:00.000000  1
296  2012-09-01 00:00:00.000000  1
297  2012-10-01 00:00:00.000000  1
298  2012-11-01 00:00:00.000000  1
299  2012-12-01 00:00:00.000000  1

[300 rows x 2 columns]

In [6]:
result[result['n'] == 3]

                          date  n
0   1991-01-01 00:00:00.000000  3
1   1991-02-01 00:00:00.000000  3
2   1991-03-01 00:00:00.000000  3
3   1991-04-01 00:00:00.000000  3
4   1991-05-01 00:00:00.000000  3
5   1991-06-01 00:00:00.000000  3
6   1991-07-01 00:00:00.000000  3
7   1991-08-01 00:00:00.000000  3
8   1991-09-01 00:00:00.000000  3
9   1991-10-01 00:00:00.000000  3
10  1991-11-01 00:00:00.000000  3
11  1991-12-01 00:00:00.000000  3

In [7]:
df1['date'].value_counts().head(12)

1991-12-01    3
1991-10-01    3
1991-06-01    3
1991-08-01    3
1991-09-01    3
1991-04-01    3
1991-02-01    3
1991-01-01    3
1991-03-01    3
1991-07-01    3
1991-11-01    3
1991-05-01    3
Name: date, dtype: int64

## 聚合效果

In [8]:
sql2 = """
        select max(beef),min(pork),sum(turkey),count(veal)
        from df2;
    """
result2 = sqldf(sql2)
result2

   max(beef)  min(pork)  sum(turkey)  count(veal)
0     2512.0      124.0     185937.3          827

In [9]:
df2.agg({'beef': max, 'pork': min, 'turkey': sum, 'veal': 'count'})

beef        2512.0
pork         124.0
turkey    185937.3
veal         827.0
dtype: float64

In [10]:
df1.merge(df2, on='date', how='inner')
sql3 = """
        select df1.*,df2.*
        from df1 inner join df2
        on df1.date = df2.date;
        """
result3 = sqldf(sql3)
result3

,date,births,date,beef,veal,pork,lamb_and_mutton,broilers,other_chicken,turkey
0,1975-01-01 00:00:00.000000,265775,1975-01-01 00:00:00.000000,2106.0,59.0,1114.0,36.0,646.2,NaN,64.9
1,1975-02-01 00:00:00.000000,241045,1975-02-01 00:00:00.000000,1845.0,50.0,954.0,31.0,570.2,NaN,47.1
2,1975-03-01 00:00:00.000000,268849,1975-03-01 00:00:00.000000,1891.0,57.0,976.0,35.0,616.6,NaN,54.4
3,1975-04-01 00:00:00.000000,247455,1975-04-01 00:00:00.000000,1895.0,60.0,1100.0,34.0,688.3,NaN,68.7
4,1975-05-01 00:00:00.000000,254545,1975-05-01 00:00:00.000000,1849.0,59.0,934.0,31.0,690.1,NaN,81.9
...,...,...,...,...,...,...,...,...,...,...
402,2012-07-01 00:00:00.000000,368450,2012-07-01 00:00:00.000000,2200.8,9.5,1721.8,12.5,3127.0,43.4,497.2
403,2012-08-01 00:00:00.000000,359554,2012-08-01 00:00:00.000000,2367.5,10.1,1997.9,14.2,3317.4,51.0,530.1
404,2012-09-01 00:00:00.000000,361922,2012-09-01 00:00:00.000000,2016.0,8.8,1911.0,12.5,2927.1,43.7,453.1
405,2012-10-01 00:00:00.000000,347625,2012-10-01 00:00:00.000000,2343.7,10.3,2210.4,14.2,3335.0,43.8,579.9
406,2012-11-01 00:00:00.000000,320195,2012-11-01 00:00:00.000000,2206.6,10.1,2078.7,12.4,3006.7,37.5,515.3

## 保存SQL

In [21]:
from sqlalchemy import create_engine

db_flag = "mysql"
host_ip = "localhost"
host_port = 3306
db_name = "First"
table_name = "test"
user = "root"
pawd = "yxfabc123"
charset = "utf-8"

engine_config = '%s%s%s%s%s%s%s%s%s%s%s' % ('mysql+pymysql://', user, ':', pawd, '@', host_ip, ':',host_port, '/', db_name,'?charset=utf8')
# print(engine_config)
engine = create_engine(engine_config)
conn = engine.connect()

df1.to_sql( table_name, conn, if_exists='append',index=False)

mysql+pymysql://root:yxfabc123@localhost:3306/First?charset=utf8

## 开启mysql的游标功能

使用python连接mysql数据库

1）六个常用的连接参数
- 参数host：mysql服务器所在的主机的ip；
- 参数user：用户名
- 参数password：密码
- 参数port：连接的mysql主机的端口，默认是3306
- 参数db：连接的数据库名
- 参数charset：当读取数据出现中文会乱码的时候，需要我们设置一下编码；我们使用python操作数据库的时候，那么python就相当于是client，我们是用这个client来操作mysql的server服务器，python3默认采用的utf8字符集，我的mysql服务器默认采用latin1字符集，因此mysql中创建的每张表，都是建表的时候加了utf8编码的，因此这里设置的应该就是connection连接器的编码。

cursor游标对象的一些常用方法

1）cursor用来执行命令的方法

- execute(query, args)：执行单条sql语句，接收的参数为sql语句本身和使用的参数列表，返回值为受影响的行数；

- executemany(query, args)：执行单条sql语句，但是重复执行参数列表里的参数，返回值为受影响的行数；

2）cursor用来接收返回值的方法

- fetchone()：返回一条结果行；

- fetchmany(size)：接收size条返回结果行。如果size的值大于返回的结果行的数量，则会返回cursor.arraysize条数据；

- fetchall()：接收全部的返回结果行；

操作MySQL，我们都习惯于用pymsq，基本流程就是
- 创建连接
- 创建游标
- 执行SQL
- 关闭连接

In [ ]:
import pymysql

# 1.创建连接
conn = pymysql.connect(host='127.0.0.1', port=3306, user='root', password='root', charset='utf8')

# 2.创建游标
cursor = conn.cursor()

# 3.执行sql语句
cursor.execute('select * from user where xxx')

result=cursor.execute(sql) #执行sql语句，返回sql查询成功的记录数目

# 关闭连接，游标和连接都要关闭
cursor.close()
conn.close()

### 创建表（建）

In [ ]:
import pymysql 
db=pymysql.connect(host='localhost',user='root', password='123456',
                   port=3306, db='huangwei', charset='utf8')

# 创建一个游标对象；
cursor = db.cursor()

# 建表语句；
sql = """create table person(
        id int auto_increment primary key not null,
        name varchar(10) not null,
        age int not null) charset=utf8"""

# 执行sql语句；
cursor.execute(sql)

# 断开数据库的连接；
db.close()

### 查询数据（查）

#### fetchone()：一次获取一条记录

In [ ]:
import  pymysql

db = pymysql.connect(host='localhost',user='root',db='huangwei',
                     password='123456',port=3306,charset='utf8')

cursor = db.cursor()

cursor.execute('select count(*) from person')
aa = cursor.fetchone()                            
print(aa)
# 注意这一句一定是在循环之外，不能放到循环里面。
# 想想这是为什么？
cursor.execute('select name,age from person')    
for i in range(aa[0]):
    a,b = cursor.fetchone()
    c = "我的名字叫{}，今年{}岁".format(a,b)
    display(c)
db.close()

#### fetchall()：一次获取所有记录

In [ ]:
import  pymysql

db = pymysql.connect(host='localhost',user='root',db='huangwei',
                     password='123456',port=3306,charset='utf8')

cursor = db.cursor()

cursor.execute('select name,age from person')
aa = cursor.fetchall()
# print(aa)
for a,b in aa:
    c = "我的名字叫{}，今年{}岁".format(a,b)
    display(c)
db.close()

### pandas中的read_sql()方法，将提取到的数据直接转化为DataFrame

In [ ]:
import pymysql 
import pandas as pd

db = pymysql.connect(host='localhost',user='root',db='huangwei',
                     password='123456',port=3306,charset='utf8')
cursor = db.cursor()

df1 = pd.read_sql("select * from student where ssex='男'",db)
display(df1)
df2 = pd.read_sql("select * from student where ssex='女'",db)
display(df2)

### 插入数据（增）

#### 一次一条

In [ ]:
import pymysql

db=pymysql.connect(host='localhost',user='root', password='123456',
                   port=3306, db='huangwei', charset='utf8')

cursor = db.cursor()

# mysql中SQL语句怎么写，这里就怎么写；
name = "猪八戒"
age = 8000
sql = 'insert into person(name,age) values ("猪八戒",8000)'

try:
    cursor.execute(sql)
    db.commit()
    print("插入成功")
except:
    print("插入失败")
    db.rollback()
db.close()

In [ ]:
import  pymysql

db=pymysql.connect(host='localhost',user='root', password='123456',
                   port=3306, db='huangwei', charset='utf8')

cursor = db.cursor()

# 插入数据
sql = 'insert into person(name,age) values(%s,%s)'
try:
    cursor.execute(sql,('孙悟空',100000))
    db.commit()
    print("插入成功")
except:
    print("插入失败")
    db.rollback()
db.close()

#### 一次性插入多条数据

In [ ]:
import  pymysql

db=pymysql.connect(host='localhost',user='root', password='123456',
                   port=3306, db='huangwei', charset='utf8')

cursor = db.cursor()

# 插入数据
sql = 'insert into person(name,age) values(%s,%s)'
# 注意：(('牛魔王',9000),('铁扇公主',8000),('玉皇大帝',6000))也可以
# 小括号都可以换为中括号
datas = [('牛魔王',9000),('铁扇公主',8000),('玉皇大帝',6000)]
try:
    cursor.executemany(sql,datas)
    db.commit()
    print("插入成功")
except:
    print("插入失败")
    db.rollback()
db.close()

### 删除数据（删）

In [ ]:
import  pymysql

db=pymysql.connect(host='localhost',user='root', password='123456',
                   port=3306, db='huangwei', charset='utf8')

cursor = db.cursor()

# 删除数据
sql = 'delete from person where age=8000'
try:
    cursor.execute(sql)
    db.commit()
    print("删除成功")
except:
    print("删除失败")
    db.rollback()
db.close()

总结如下：

- ① pymysql模块是默认开启mysql的事务功能的，因此，进行 "增"、 "删"、"改"的时候，一定要使用db.commit()提交事务，否则就看不见所插入的数据。

- ② 进行 "增"、"删"、"改"的时候，一定要使用try…except…语句，因为万一没插入成功，其余代码都无法执行。当语句执行不成功，我们就db.rollback()回滚到操作之前的状态；当语句执行成功，我们就db.commit()提交事务。